var local_database = [
    {
        date: "Sep 18 2016",
        author: "林白衣",
        title: "秋雨无声秋有声，秋音秋韵秋绕梁",
        imgSrc: "/images/post/fall.png",
        headImgSrc: "/images/post/fall.png",
        avatar: "/images/avatar/04.png",
        content: "喝醉酒的太阳，泛着赤红的脸膛，和着猎猎秋风喊道：“秋天来了!”冬孕育，春起拍，夏烘托，秋天是“四季歌”中最华美最震撼人心的一章！浩浩秋风，漫过长城，涌流于北方原野。随后，以千军万马之势越过长江，描绘出色彩斑斓的江南美景。人的心胸为之开阔，如天高云淡的长空。",
        reading: "112",
        collection: "96",
        postId: 0,
        dateTime: "一小时前",
        detial: "曾经有许多的梦想，哪天自己可以成为一个作家， 用手中利刃刻画自己的心情， 用鲜血和汗水湿润情感的天堂， 渴望拥有爱情的心情，就仿佛想用利刃去追求和平，那就是潮中行舟； 每次失意的时候，我总是万分苦恼，我难以忍受这样的折磨，失意的心酸， 让我感觉沉寂，宛如一颗石子掉入深渊，最后沉到谷底， 郁闷苦涩， 更多的是痛。 于是， 更多的时候选择孤独， 孤独里， 我可以一个人轻松的享受秋风的磨梭， 寂寞里， 我可以轻轻享受细雨的温馨， 那缠绵而温柔的雨点， 仿佛就是打开心灵之窗的美妙乐点； 听是谁在唱歌； 树木的气息，偶尔有点异样，那不是清新， 而是枯寂，腐败的味道，我不曾停留， 矫健的身手，那是我在林间飞步， 小狗小猫，那我最喜欢的宠物，总喜欢对我倾诉， 倾诉自己的忧愁，我总是默默听他们诉说自己的心情， 彼此相望的眼神， 来的是痛苦，回的依然是痛苦， 有人说：有福同享有难同当，殊不知，难的同享，就宛若病毒的扩散；我不能治疗他们的病，反而被传染了， 于是我内心的痛苦来得比他们更猛烈， 那来回一微秒间，我已经不能动弹， 他们只知道喋喋不休的述说，却不曾有感觉我的痛楚； 我麻木了，渐渐听不见他们的声音， 停留在山林间，不再有飞步，不再有闪烁， 有的只是满腔的愤慨，那不是积怨， 那不是痛楚，而是内心闪烁的泪珠， 是喜悦，是等待， 渐渐的，天黑了，风起了， 林间依然那么平静，一幅画， 一个身影坐在草坪的这一头， 另一个远远地站在草坪外， 相望，那是眼波地交织， 那是心灵地传递，渐渐弥漫在整个秋天. 秋天是明快的，清风拂面神清气爽飘逸洒脱。 秋天的落叶是浪漫诗意的，拥抱大地，随风飘扬，漫天飞舞。",
        music: {
            url: 'http://ws.stream.qqmusic.qq.com/M500001VfvsJ21xFqb.mp3?guid=ffffffff82def4af4b12b3cd9337d5e7&uin=346897220&vkey=6292F51E1E384E061FF02C31F716658E5C81F5594D561F2E88B854E81CAAB7806D5E4F103E55D33C16F3FAC506D1AB172DE8600B37E43FAD&fromtag=46',
            title: '此时此刻-许巍',
            coverImg: 'http://y.gtimg.cn/music/photo_new/T002R300x300M000003rsKF44GyaSk.jpg?max_age=2592000'
        }
    },

    {
        date: "Feb 2 22 2017",
        title: "比利·林恩的中场战事",
        author: "林白衣",
        imgSrc: "/images/post/bill.png",
        headImgSrc: "/images/post/bill.png",
        avatar: "/images/avatar/01.png",
        content: "伊拉克战争时期，来自美国德州的19岁技术兵比利·林恩（乔·阿尔文 Joe Alwyn 饰）因为一段偶然拍摄的视频而家喻户晓。那是一次规模不大却激烈非常的遭遇战，战斗中林恩所在的B班班长（范·迪塞尔 Vin Diesel 饰）遭到当地武装分子的伏击和劫持，而林恩为了营救班长不惜铤而走险冲锋陷阵。视频公布于世让他成为全美民众所崇拜的英雄，然而却鲜有人理解他和战友们所经历的一切……",
        reading: "100",
        collection: "88",
        postId: 1,
        dateTime: "2小时前",
        detial: "比利·林恩的中场战事》（英语：Billy Lynn's Long Halftime Walk）是一部2016年上映的美国战争剧情片，由李安执导，让-克里斯托弗·卡斯特里撰写剧本。电影改编自本·方登所创作的小说《半场无战事》。由乔·阿尔文、克里斯汀·斯图尔特、克里斯·塔克、加内特·赫德兰、范·迪塞尔和史蒂夫·马丁主演。电影正式于2015年4月在美国乔治亚州开拍。该片为三星影业负责发行，并定于2016年11月11日全球同步上映。故事叙述士兵比利·林恩在伊拉克战争中战斗时（巷战），为了营救长官铤而走险冲锋陷阵击败一名敌人的镜头刚好被摄影机捕捉到，19岁的他参加班长的葬礼短暂回美国后便此成为受捧的英雄；受邀参加在达拉斯的美式橄榄球赛的感恩节比赛，球场的比赛绚丽开幕，劲歌热舞，在充满荣耀的光辉围绕着他时，绚丽烟花的背后，比利同时也渐渐地察觉到现实和战争的残酷对比，他内心的痛苦被无耻的消费，家人的各种不理解，他的经历只是老板的剧本，他喜欢的人也只是爱着他的光环。",
        music: {
            url: 'http://ws.stream.qqmusic.qq.com/C100002I8eGJ28BI17.m4a?fromtag=38',
            title: '朋友-谭咏麟',
            coverImg: 'http://y.gtimg.cn/music/photo_new/T002R150x150M000004eGsCN3SUheO.jpg?max_age=2592000'
        }
    },

    {
        date: "Nov 03 2016",
        title: "血战钢锯岭",
        author: "林白衣",
        imgSrc: "/images/post/defaultcover.png",
        headImgSrc: "/images/post/defaultcover.png",
        avatar: "/images/avatar/03.png",
        content: "1945年，第二次世界大战接近尾声，作为邪恶轴心重要成员的日本，其嚣张态势已成强弩之末。是年，决定战局走向的冲绳岛战役拉开序幕，成千上万斗志昂扬的美国大兵被派往冲绳，等待他们的则是敌军重兵防守、凶险异常的钢锯岭。在这群人中间，却有一个不愿拿起武器的军医。他名叫戴斯蒙德·道斯（安德鲁·加菲尔德 Andrew Garfield 饰），来自美国的弗吉尼亚。太平洋爆发之际，瘦弱的戴斯蒙德志愿成为救死扶伤的军医而应征入伍。可因童年和家庭的原因，他始终不愿拿起枪支操练，为此宁愿背上拒服兵役的罪名被送上军事法庭。几经周折，戴斯蒙德最终和战友来到了钢锯岭。枪林弹雨，转瞬之间无数人应声倒地。在信仰和信念的支持下，戴斯蒙德仅凭一己之力拯救了数十条濒死的生命……",
        reading: "124",
        collection: "90",
        postId: 2,
        dateTime: "30分钟前",
        detial: "血战钢锯岭》（英语：Hacksaw Ridge）是一部2016年美国和澳洲合拍的传记战争片，由梅尔·吉布森执导，剧本为安德鲁·奈特、罗伯特·申坎和蓝道尔·华利斯共同负责撰写。电影主演包括安德鲁·加菲尔德、文斯·范恩、萨姆·沃辛顿、路克·布莱西、雨果·威文、瑞恩·科尔、特雷莎·帕尔默、李察·派罗斯和瑞秋·葛瑞菲斯。正式拍摄于2015年9月5日在澳洲的新南威尔士州开始进行。电影定于2016年11月4日在美国上映，并获得影评人与观众的一致好评，被认为是吉勃逊东山再起之作。故事改编自美国陆军军医德斯蒙德·T·多斯的真人真事。德斯蒙德尽管因宗教信仰而拒绝携带武器和杀人，但因在第二次世界大战期间的冲绳岛战役中，德斯蒙德英勇拯救了超过七十五名战友的生命而得到哈瑞·S·杜鲁门总统授予荣誉勋章，成为备受爱戴的荣誉反战人士。",
        music: {
            url: 'http://ws.stream.qqmusic.qq.com/C100003507bR0gDKBm.m4a?fromtag=38',
            title: '夜夜夜夜-齐秦',
            coverImg: 'http://y.gtimg.cn/music/photo_new/T002R150x150M000001TEc6V0kjpVC.jpg?max_age=2592000'
        }

    },

    {
        date: "Mar 05 2016",
        title: "微信小程序开发教程--从零开始",
        author: "林白衣",
        imgSrc: "/images/post/wechat.png",
        headImgSrc: "/images/post/wechat.png",
        avatar: "/images/avatar/05.png",
        content: "今天一不小心拿到了小程序的内测资格，为了不辜负微信团队的信任，我决定十一奋斗一把！不过话说我可是一个Android工程师啊！所以就让我们从零开始！所以本文非常适合非前端工程师学习！哈哈！都说小程序出来前端会抢移动端饭碗，但是据我所知现在好多学习的都是移动开发工程师，谁抢谁的还不一定呢！PS：表问我怎么拿到小程序内测资格的，有种东西叫内部资源！",
        reading: "250",
        collection: "250",
        postId: 3,
        dateTime: "1小时前",
        detial: "原则及相关说明 ​ 微信最核心的价值，就是连接——提供一对一、一对多和多对多的连接方式，从而实现人与人、人与智能终端、人与社交化娱乐、人与硬件设备的连接，同时连接服务、资讯、商业。 ​ 微信团队一直致力于将微信打造成一个强大的、全方位的服务工具。在此基础上，我们推出了微信小程序这个产品，提供给微信小程序的开发者在微信内搭建和实现特定服务、功能的平台。通过全面开放的能力，我们将更多连接的可能给予企业和服务提供者，并为微信小程序提供基础的接入能力、运营环境和规则体系，进而帮助更多的企业和服务提供者建立自己的品牌，将商业机会带给整个微信产业链。 ​ 在开始微信小程序的开发前，我们希望微信小程序开发者（以下也称为“你”）已经仔细阅读了《微信小程序接入指南》、《微信小程序设计规范》、《微信小程序开发指南》等；同时，我们也为你准备了微信小程序平台常见拒绝情形。希望这些指南和规范，能够一定程度上帮助你解决开发、运营微信小程序过程中所遇到的疑问。 ​ 我们希望你提交的微信小程序，能够符合微信团队一直以来的价值观，那就是：一切以用户价值为依归、让创造发挥价值、好的产品是用完即走，以及让…帐号基本信息 小程序名称、简介、logo、服务范围、服务标签、帐号基本信息文字均不得： （1）侵犯他人权益（著作权、商标权、肖像权、名誉权等）。包括但不限于，使用或包含不属于该小程序主体的品牌或商标、标识等内容或与之相似的内容、信息、特殊角标。示例：检查名称、简介中是否含有该小程序不属于该帐号的权益。 （2）含有商业化用语的、热门小程序名称、“国家级”、“最高级”等新广告法明令禁止或其他无关的词语。 （3）含有政治、色情、敏感、暴力血腥、恐怖、其他国家法律法规禁止的词汇及违法内容。 特别规则 2.1小程序名称、简介： （1）小程序的简介需明确介绍小程序的功能点，不能使用模糊的词义表达，比如：该小程序旨在提高用户的生活品味、该小程序旨在提高用户的购物体验。示例：能在简介中提炼该小程序的几个功能点。 （2）名称、简介的信息表达的意思必须有关联，具有一致性，并应与实际提供的功能一致，不含有与功能无关的搜索热词。示例：简介中能找到小程序名称或者分拆出来的词汇。 （3）小程序名称不能以电话、邮件、日历等广义归纳类、普遍且不具有识别性词语来命名。示例：名称不是是单词汇，必须是两个词以上的组…",
        music: {
            url: 'http://ws.stream.qqmusic.qq.com/C100004HLusI2lLjZy.m4a?fromtag=38',
            title: '女儿情-万晓利',
            coverImg: 'http://y.gtimg.cn/music/photo_new/T002R150x150M000004Wv5BO30pPc0.jpg?max_age=2592000'
        }

    }
]

module.exports = {
    postList: local_database
}